# coding: utf-8

text = """北京 北京大学 184820 沈洋 C/C++程序设计大学 A 组省赛 一等奖 是
北京 清华大学 148567 彭天翼 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京大学 180969 林泽辉 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 119153 赵轩昂 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 174011 易毅 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 清华大学 191307 温和 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 185479 黄轩成 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 清华大学 191292 乔明达 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 清华大学 191353 钱雨杰 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京大学 180659 钟原 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 179998 唐靖哲 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 145343 康燕斌 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京邮电大学 189712 刘润涛 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京工业大学 114780 张天博 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 143539 马鑫宇 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 141094 金胜莺 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京大学 183848 郑泽宇 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 119453 董宣毅 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 141163 赵海宇 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 184014 董昊 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 174008 李沛奇 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京大学 180114 周子凯 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 141010 朱翼 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京工业大学 114753 张远行 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京邮电大学 183102 王振宇 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京邮电大学 189700 徐心仪 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 清华大学 191786 罗雨屏 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京大学 185603 孙周易 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 178061 史烨轩 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 121572 潘虹宇 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 140580 刘垚鹏 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 123163 刘明汉 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 141162 李周洋 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 113444 骆石英 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 183885 冯大蕗 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 123097 贾容千 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 157114 孙莹 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 120672 汪旦丁 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京化工大学 114896 罗晨涛 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 149589 宦成颖 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京大学 180152 黎才华 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 180356 陈谋 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 181132 李搏 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 123022 陈敬伍 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 120372 刘毅博 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 清华大学 191437 姚炫容 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 156759 颜振松 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 华北电力大学(北京) 137463 刘妍君 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京科技大学 134510 孔浩 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京林业大学 187099 林铮 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 中国地质大学(北京) 143606 吴琦 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 140465 王鹿鸣 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 123078 秦欢 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 145322 王戍 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 174078 池灵琪 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 119362 王昌宝 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 181101 冯炜韬 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 181117 岳桐宇 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 华北电力大学(北京) 137443 宋礼 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 140715 杜正远 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 首都师范大学 125155 尹航 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京科技大学 188677 孙梦瑶 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 140781 赵东方 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 141170 李云涛 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 185002 张大猷 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北方工业大学 113957 苏子洲 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 140514 李明星 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 178304 杨朝晖 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 178421 吕佳高 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 179259 何雨 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 179945 何玥 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 183824 向朝彬 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 179650 陈逸伦 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 174003 刘啸 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 清华大学 191345 王启圣 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京大学 181644 王易檀 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京工业大学 121811 杜仑 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京邮电大学 189713 杨清平 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 178539 焦惠达 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 中国石油大学(北京) 162233 王显灿 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京科技大学 142349 董书言 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 178644 田茂清 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 179269 冯志睿 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 183921 刘晨龙 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 180441 魏葳 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 181436 郝泽锟 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京大学 146816 吴俊霖 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 129573 成诚 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 中国地质大学(北京) 183130 田志宝 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 145745 许若昕 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 177745 罗天歌 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 180141 李大欣 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 181083 张天宇 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 181123 于昊霖 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京化工大学 142752 徐阳 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 183836 赵磊 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 184132 刘炯昊 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 华北电力大学(北京) 137046 梁兴仑 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 华北电力大学(北京) 165955 邹昌铭 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京科技大学 186470 陶立强 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 178445 王立斌 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京理工大学 123446 刘达远 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京化工大学 167005 王岩 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 180743 何涛 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 中国农业大学 155102 林力蔚 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京工业大学 114779 王云帆 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 121178 邵思豪 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 中国石油大学(北京) 173287 黄冠熹 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 140539 李炎 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京工业大学 171942 刘畅 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 132298 刘铠齐 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 139174 王剑锋 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 179020 刘英伦 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 179833 张奥 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 179963 刘保证 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 180008 孙镜涵 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 180135 刘海博 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京化工大学 167025 陈国庆 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 183938 孔祥远 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 清华大学 191821 朱新瑞 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 中国地质大学(北京) 184310 赵嘉诚 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 121186 李鹏翔 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京航空航天大学 122862 安康 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京化工大学 167562 陈朝祥 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 北京交通大学 149878 李若森 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 中国矿业大学(北京) 184363 茅耘恺 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 中央民族大学 100739 周文敏 C/C++程序设计大学 A 组省赛 一等奖 是 
北京 中国传媒大学 173104 黄琨 C/C++程序设计大学 A 组省赛 一等奖 是
北京 北京信息科技大学 101871 施尔宁 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 116671 冯硕 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 115152 韩瑞昕 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 108719 郭菁华 C/C++程序设计大学 B 组省赛 一等奖 是
北京 中国人民公安大学 135840 夏志成 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工业大学耿丹学院 174462 靳嘉豪 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 178780 李景琳 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 169405 李冰凌 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都经济贸易大学 186292 叶霖 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京信息科技大学 112224 刘鸿喆 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 127838 李申达 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 141864 李玉珂 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工业大学耿丹学院 165969 闫璟 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 139047 毛文祥 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 149494 孟文明 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 155044 张泽宇 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京建筑大学 139919 秦蒙 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 169557 阳香平 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 118518 马瑞 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京信息科技大学 139096 陈伟颖 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 141462 王黄博昂 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 113969 张伟 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 139587 史存存 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 141243 张宇翔 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 150840 陈亚康 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 153941 唐成早 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 153956 商逸凡 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工业大学耿丹学院 160224 蔡志鹏 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京建筑大学 158359 方书玮 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 147404 韩特 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 119998 王泓键 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京信息科技大学 140826 谯洪 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 154181 张留莹 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京信息科技大学 153810 张浩然 C/C++程序设计大学 B 组省赛 一等奖 是
北京 中国人民解放军装甲兵工程学院 181024 刘威 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 140214 崔仕明 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 175746 崔家源 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 177413 詹雪东 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 178363 郭璇 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 189284 于佑然 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 132360 陈禹志 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京物资学院 158717 王冯然 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 142517 田紫烟 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 147618 王姜闻 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 150683 姜捷 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 176863 孙京博 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 177588 贾冬柏 C/C++程序设计大学 B 组省赛 一等奖 是
北京 中国人民解放军装甲兵工程学院 111891 郎卓涛 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 175183 周浩 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 131016 常智伦 C/C++程序设计大学 B 组省赛 一等奖 是
北京 中国人民解放军装甲兵工程学院 181004 陈建 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京联合大学 137160 李强 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 136121 王琦祎 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 155258 刘帅帅 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京石油化工学院 185893 张博伟 C/C++程序设计大学 B 组省赛 一等奖 是
北京 中国人民解放军装甲兵工程学院 180584 廖玺铭 C/C++程序设计大学 B 组省赛 一等奖 是
北京 中国人民解放军装甲兵工程学院 181078 李家驹 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北方工业大学 175491 王冰 C/C++程序设计大学 B 组省赛 一等奖 是
北京 首都师范大学 190133 崔悦 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京工商大学 130045 杨培文 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京建筑大学 160727 王连杰 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京信息科技大学 154966 刘照阁 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京石油化工学院 106072 董海峰 C/C++程序设计大学 B 组省赛 一等奖 是
北京 北京邮电大学世纪学院 171525 孙子杰 C/C++程序设计大学 B 组省赛 一等奖 是
北京 中国人民解放军陆军航空兵学院 188619 丁晨曦 C/C++程序设计大学 B 组省赛 一等奖 是"""

lines = text.split("\n")
Aschools = {}
Bschools = {}
for line in lines:
    item = line.split(" ")
    schoolname = item[1]
    if line.find("A 组") != -1:
        if schoolname in Aschools:
            Aschools[schoolname] += 1
        else:
            Aschools[schoolname] = 1
    else:
        if schoolname in Bschools:
            Bschools[schoolname] += 1
        else:
            Bschools[schoolname] = 1
print "A 组:"
for school in Aschools:
    print school, Aschools[school]

print "B 组:"
for school in Bschools:
    print school, Bschools[school]
